### Working with pandas dataframes

[Official Documentation](https://pandas.pydata.org/docs/)

[Course page](https://ds.codeup.com/python/dataframes/)

<div class="alert alert-block alert-info">

#### Learning Goals
    
- Understand the structure of a dataframe
- View information about the contents of a dataframe
- Determine attributes of the data within the dataframe
- Manipulate columns
- Sort and filter contents of dataframe
- Create, modify, and drop columns
- View descriptive statistics for data

### Sources of dataframes

- Created from dictionaries, lists, or arrays
- Imported from Python libraries (e.g. `pydataset`)
- Read from `csv`, `tsv`, `xlsx` files
- SQL databases

---

### Import statements

In [2]:
# Imported libraries
import pandas as pd

# Numpy to build arrays
import numpy as np

# Source of datasets
from pydataset import data

# Set a value to initialize the random integer generation
np.random.seed(123)

---

## Creating a dataframe

- Combine multiple series of equal length.

In [85]:
# Create a list of students
students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas', 'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

In [86]:

# Randomly generate 12 scores for each subject (1 per student)
# Store values as arrays
# Note that all the values need to have the same length here

math_grades = np.random.randint(low=60, high=100, size=len(students))

english_grades = np.random.randint(low=60, high=100, size=len(students))

reading_grades = np.random.randint(low=60, high=100, size=len(students))

In [87]:
# Create a dictionary with structure:
# 'column_name': <array or list>

df_dict = {'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades}

In [88]:

# Use pd.DataFrame
df = pd.DataFrame(df_dict)

# View the type
type(df)

pandas.core.frame.DataFrame

### Check data types

In [7]:
type(students)

list

In [8]:
type(reading_grades)

numpy.ndarray

In [9]:
type(df_dict)

dict

### Display a table for the dataframe

In [82]:
df

       name  math  english  reading
0     Sally    85       65       74
1      Jane    95       69       74
2     Suzie    63       64       83
3     Billy    61       83       88
4       Ada    67       81       76
5      John    66       85       84
6    Thomas    95       96       75
7     Marie    93       88       76
8    Albert    99       95       80
9   Richard    78       79       86
10    Isaac    88       77       64
11     Alan    98       99       81

In [11]:
display(df)

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

### Dimension of dataframe

Format: A tuple with (rows, columns)

In [12]:
df.shape

(12, 4)

### View portions of the dataframe

```python
.head(n) # first n rows (default = 5 rows)
.tail(n) # last n rows (default = 5 rows)
.sample(n) # randomly select n rows (default = 1 row)
```

In [14]:
df.head(2)

    name  math  english  reading
0  Sally    62       85       80
1   Jane    88       79       67

In [15]:
df.tail(3)

       name  math  english  reading
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [33]:
df.sample(3)

     name  math  english  reading
4     Ada    77       92       98
3   Billy    98       96       88
8  Albert    92       62       87

### Information about the dataframe's contents

| Name | Description |
| ---:|:------ |
|`#`  | The row index|
|`Column`| Index/name of column (a string) |
|`Non-Null Count` | Number of non-empty values 
|`Dtype` |    The data type |

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     12 non-null     object
 1   math     12 non-null     int64
 2   english  12 non-null     int64
 3   reading  12 non-null     int64
dtypes: int64(3), object(1)
memory usage: 512.0+ bytes

### Data types

In [35]:
df.dtypes

name       object
math        int64
english     int64
reading     int64
dtype: object

### Descriptive Statistics

In [37]:
df.describe().round(2)

        math  english  reading
count  12.00    12.00    12.00
mean   84.83    77.67    86.50
std    11.13    13.37     9.64
min    62.00    62.00    67.00
25%    78.50    63.75    80.75
50%    90.00    77.50    89.00
75%    92.25    86.75    93.25
max    98.00    99.00    98.00

---

## Working with Columns

- View column information
- Rename columns
- Drop columns

### View Column Information

In [39]:
cols = df.columns

### Check data types

In [40]:
type(cols)

pandas.core.indexes.base.Index

In [41]:
col_list = df.columns.tolist()

In [42]:
type(col_list)

list

In [45]:
index_list = df.index.tolist()
type(index_list)

list

<div class="alert alert-block alert-info">
    
### Important Notes
    
- Keep in mind what data structure you are working with
- Recall that methods do not alter the original data structure
- Check documentation for what the parameters and results of a pandas function are

### Dropping columns

- Drop all columns except for the student's name and math grade
- Assign the results to a new dataframe

In [46]:
df.columns

Index(['name', 'math', 'english', 'reading'], dtype='object')

In [48]:
df.drop(columns = ['english', 'reading'])

       name  math
0     Sally    62
1      Jane    88
2     Suzie    94
3     Billy    98
4       Ada    77
5      John    79
6    Thomas    82
7     Marie    93
8    Albert    92
9   Richard    69
10    Isaac    92
11     Alan    92

In [49]:
df

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72


### Tip

- Create a list with the columns you want to drop

In [50]:
dropped_columns = ['english', 'reading']

In [51]:
df.drop(columns = dropped_columns)

       name  math
0     Sally    62
1      Jane    88
2     Suzie    94
3     Billy    98
4       Ada    77
5      John    79
6    Thomas    82
7     Marie    93
8    Albert    92
9   Richard    69
10    Isaac    92
11     Alan    92

### Renaming columns

- Rename the columne `name` to `student`
- Use a dictionary structure
- Assign to a new dataframe

```python
{'old_name': 'new_name'}
```

In [52]:
df.columns

Index(['name', 'math', 'english', 'reading'], dtype='object')

In [53]:
df.rename(columns = {'name':'student'})

    student  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

### Selecting a column

In [66]:
math_series = df['math']
type(math_series)

pandas.core.series.Series

In [61]:
math_reading_performance = df[['math', 'reading']]

In [62]:
type(math_reading_performance)

pandas.core.frame.DataFrame

In [63]:
math_reading_performance

    math  reading
0     62       80
1     88       67
2     94       95
3     98       88
4     77       98
5     79       93
6     82       81
7     93       90
8     92       87
9     69       94
10    92       93
11    92       72

In [71]:
math_values = df.math

In [72]:
type(math_values)

pandas.core.series.Series

### Creating new columns


- Use a comparison operator on a column to return Boolean values 
- Create a new column with these contents
- Use assign to set the column values equal to the Boolean values

In [83]:
# column bracket notation
df['math'] = df.math >= 70

In [84]:
df

       name   math  english  reading
0     Sally   True       65       74
1      Jane   True       69       74
2     Suzie  False       64       83
3     Billy  False       83       88
4       Ada  False       81       76
5      John  False       85       84
6    Thomas   True       96       75
7     Marie   True       88       76
8    Albert   True       95       80
9   Richard   True       79       86
10    Isaac   True       77       64
11     Alan   True       99       81

In [91]:
df_high_score_math = df[df.math >= 90]

In [92]:
df_high_score_math

      name  math  english  reading
0    Sally    92       82       89
1     Jane    99       85       79
3    Billy    94       60       61
5     John    99       79       77
7    Marie    99       67       73
8   Albert    95       99       85
9  Richard    98       83       93

---

### Sorting dataframes

- Use `.sort_values`
- set which column to sort by
- Set ascending or descending

In [95]:
df.sort_values(by = 'english', ascending = False)

       name  math  english  reading
8    Albert    95       99       85
4       Ada    78       95       65
6    Thomas    86       90       95
1      Jane    99       85       79
9   Richard    98       83       93
0     Sally    92       82       89
5      John    99       79       77
10    Isaac    61       79       89
11     Alan    77       74       66
2     Suzie    61       70       97
7     Marie    99       67       73
3     Billy    94       60       61

### Chaining Operations

In [100]:
df[df.english > 90].sort_values(by = 'english').head(1).name

4    Ada
Name: name, dtype: object

---

## Importing datasets

```python
import pandas as pd
from pydataset import data
```

### View available datasets

In [101]:
data()

        dataset_id                                             title
0    AirPassengers       Monthly Airline Passenger Numbers 1949-1960
1          BJsales                 Sales Data with Leading Indicator
2              BOD                         Biochemical Oxygen Demand
3     Formaldehyde                     Determination of Formaldehyde
4     HairEyeColor         Hair and Eye Color of Statistics Students
..             ...                                               ...
752        VerbAgg                  Verbal Aggression item responses
753           cake                 Breakage Angle of Chocolate Cakes
754           cbpp                 Contagious bovine pleuropneumonia
755    grouseticks  Data on red grouse ticks from Elston et al. 2001
756     sleepstudy       Reaction times in a sleep deprivation study

[757 rows x 2 columns]

In [102]:
 data('mpg', show_doc = True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [104]:
data('mpg')

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

---
<div class="alert alert-block alert-success">
    
### In-class exercise 

- Randomly select one dataset from `pydataset`
- Load the dataset as a dataframe
- View information about the dataset


---

### Logical Operators


 `&`    and 
 
 `|`    or
 
 `not`  not

### Examples

### Find students who are eligible for:

- High-performer award (At least 80 in Math and English and Reading)
- Subject award (at least 90 in a subject)
- Exemplary award (at least 90 in all subjects)

In [107]:

df[ (df['math'] >= 80) & (df['reading'] >= 80) & (df['english'] >= 80)]

      name  math  english  reading
0    Sally    92       82       89
6   Thomas    86       90       95
8   Albert    95       99       85
9  Richard    98       83       93

In [110]:
df[ (df['math'] >= 90) & (df['reading'] >= 90) & (df['english'] >= 90)]

Empty DataFrame
Columns: [name, math, english, reading]
Index: []